wedding-store-backend/app/models/product.rb

SELECT "products".* FROM "products"
---
  scope :by_type, ->(type) { where(product_type: type) if type.present? }