wedding-store-backend/app/controllers/admin_controller.rb

  def dashboard_metrics
    active_rentals = Order.where(status: ['CONFIRMED', 'PACKED', 'OUT_FOR_DELIVERY', 'DELIVERED']).count
    upcoming_returns = RentalBooking.where(end_date: Date.today..1.week.from_now).count
    late_returns = Order.where(status: 'LATE').count

    recent_bookings = Order.order(created_at: :desc).limit(10).as_json(include: :user)
---
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" IN ('CONFIRMED', 'PACKED', 'OUT_FOR_DELIVERY', 'DELIVERED')
SELECT COUNT(*) FROM "rental_bookings" WHERE "rental_bookings"."end_date" BETWEEN '2026-02-27' AND '2026-03-06'
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = 'LATE'
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 10

  def calendar
    # Fetch all rental bookings with associated order and product data
    bookings = RentalBooking.includes(order_item: { order: :user }, product: [])
                            .order(start_date: :asc)

    calendar_data = bookings.map do |booking|
      {
        id: booking.id,
        product_id: booking.product_id,
        product_name: booking.product.name,
        size: booking.size,
        start_date: booking.start_date,
        end_date: booking.end_date,
        status: booking.status,
        order_id: booking.order_item.order_id,
        customer_email: booking.order_item.order.user&.email,
        order_status: booking.order_item.order.status,
        total_price: booking.order_item.order.total_price,
        deposit_total: booking.order_item.order.deposit_total,
        created_at: booking.created_at
---
SELECT "rental_bookings".* FROM "rental_bookings" ORDER BY "rental_bookings"."start_date" ASC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3, 4, 5, 9, 10, 11, 12, 13, 14)
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19)
SELECT "products".* FROM "products" WHERE "products"."id" IN (10, 11, 13, 12, 17, 19, 20, 21, 22)