wedding-store-backend/app/controllers/application_controller.rb

  def authenticate_user
    header = request.headers['Authorization']
    token = header&.split(' ')&.last
    decoded = JsonWebToken.decode(token)
    @current_user = User.find(decoded[:user_id]) if decoded
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1