wedding-store-backend/app/controllers/auth_controller.rb

  def register
    user = User.new(
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
      role: params[:role] || :customer
    )

    if user.save
---
INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES ('devendra@mail.com', '$2a$12$Xnhm..YxejlXl6VAbsQK.uaao6ry8Kd5mAXc4CG8oscwFmeg96tPa', 0, '2026-02-27 11:42:23.780470', '2026-02-27 11:42:23.780470') RETURNING "id"