wedding-store-backend/app/controllers/orders_controller.rb

  def index
    if @current_user.admin?
      @orders = Order.preload(:user, order_items: [:product, :rental_booking]).all.order(created_at: :desc)
    else
      @orders = @current_user.orders.preload(order_items: [:product, :rental_booking]).order(created_at: :desc)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 2 ORDER BY "orders"."created_at" DESC
SELECT "products".* FROM "products" WHERE "products"."id" IN (11, 17)
SELECT "rental_bookings".* FROM "rental_bookings" WHERE "rental_bookings"."order_item_id" IN (1, 2)
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2)

  def create
    @order = @current_user.orders.build(order_params)
    if @order.save
---
INSERT INTO "orders" ("user_id", "status", "total_price", "deposit_total", "address", "created_at", "updated_at") VALUES (2, 'PENDING', 4800015000.05, 15000.0, 'safdrs', '2026-02-27 09:18:33.626876', '2026-02-27 09:18:33.626876') RETURNING "id"

  def update
    if @order.update(order_params)
---
UPDATE "orders" SET "status" = 'CONFIRMED', "updated_at" = '2026-02-27 09:28:53.724544' WHERE "orders"."id" = 1