wedding-store-backend/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "product_type", "rent_price", "sale_price", "security_deposit", "total_quantity", "sizes", "active", "created_at", "updated_at") VALUES ('test', 'asadsf', 'BOTH', 100.0, 0.0, 1000.0, 1, '["S","M","L","XL"]', TRUE, '2026-02-27 10:42:13.199337', '2026-02-27 10:42:13.199337') RETURNING "id"
SELECT "products".* FROM "products" WHERE "products"."id" = 18 LIMIT 1
---
  def create
    @product = Product.new(product_params)
    image_blob = params.dig(:product, :image)

    if @product.save
      if image_blob
        @product.image.attach(image_blob)
        @product.reload
      end
      render json: @product, status: :created
    else
      render json: { error: @product.errors.full_messages.join(', ') }, status: :unprocessable_entity

UPDATE "products" SET "updated_at" = '2026-02-27 10:29:39.344106' WHERE "products"."id" = 17
---
  def update
    image_blob = params.dig(:product, :image)
    remove_image = params.dig(:product, :remove_image) == 'true'

    if @product.update(product_params)