wedding-store-backend/app/controllers/rental_bookings_controller.rb

  def availability
    # Public endpoint - no authentication required
    product_id = params[:product_id]
    size = params[:size]

    return render json: { error: 'Product ID and size are required' }, status: :bad_request unless product_id && size

    product = Product.find_by(id: product_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = 13 LIMIT 1