wedding-store-backend/app/services/booking_service.rb

  def self.available?(product_id, start_date, end_date, size)
    product = Product.find(product_id)
    return false unless product.active

    # Check if size is available for this product
    return false unless product.sizes.include?(size)

    # Core double booking prevention logic:
    # A booking is blocked if: (start_date <= existing_end_date) AND (end_date >= existing_start_date)
    overlapping_bookings = RentalBooking.where(product_id: product_id, size: size)
                                        .where('start_date <= ? AND end_date >= ?', end_date, start_date)
                                        .count
---
SELECT "products".* FROM "products" WHERE "products"."id" = 19 LIMIT 1
SELECT COUNT(*) FROM "rental_bookings" WHERE "rental_bookings"."product_id" = 19 AND "rental_bookings"."size" = 'M' AND (start_date <= '2026-06-03' AND end_date >= '2026-06-01')

  def self.get_booked_dates(product_id, size)
    product = Product.find_by(id: product_id)
    return [] unless product

    bookings = RentalBooking.where(product_id: product_id, size: size, status: 'active')
                            .select(:start_date, :end_date)

    booked_dates = []
    bookings.each do |booking|
---
SELECT "products".* FROM "products" WHERE "products"."id" = 19 LIMIT 1
SELECT "rental_bookings"."start_date", "rental_bookings"."end_date" FROM "rental_bookings" WHERE "rental_bookings"."product_id" = 11 AND "rental_bookings"."size" = 'M' AND "rental_bookings"."status" != 'CANCELLED'
SELECT "rental_bookings"."start_date", "rental_bookings"."end_date" FROM "rental_bookings" WHERE "rental_bookings"."product_id" = 17 AND "rental_bookings"."size" = 'S' AND "rental_bookings"."status" = 'active'