wedding-store-backend/app/services/booking_service.rb

INSERT INTO "orders" ("user_id", "status", "total_price", "deposit_total", "address", "created_at", "updated_at") VALUES (4, 'PENDING', 3000.0, 5000.0, '123 Test Street, User 1', '2026-02-27 10:49:59.826089', '2026-02-27 10:49:59.826089') RETURNING "id"
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "size", "created_at", "updated_at") VALUES (4, 19, 1, 1000.0, 'M', '2026-02-27 10:49:59.834392', '2026-02-27 10:49:59.834392') RETURNING "id"
INSERT INTO "rental_bookings" ("order_item_id", "product_id", "start_date", "end_date", "size", "status", "created_at", "updated_at") VALUES (4, 19, '2026-06-01', '2026-06-03', 'M', 'active', '2026-02-27 10:49:59.840636', '2026-02-27 10:49:59.840636') RETURNING "id"
---
  def self.create_booking(user:, product_id:, start_date:, end_date:, size:, address:)
    product = Product.find(product_id)

    unless available?(product_id, start_date, end_date, size)
      return { success: false, message: 'Product not available for selected dates/size' }
    end

    ActiveRecord::Base.transaction do
      days = (end_date.to_date - start_date.to_date).to_i + 1
      rent_total = product.rent_price * days
      deposit = product.security_deposit

      order = Order.create!(
        user: user,
        status: :pending,
        total_price: rent_total,
        deposit_total: deposit,
        address: address
      )

      order_item = OrderItem.create!(
        order: order,
        product: product,
        quantity: 1,
        price: product.rent_price,
        size: size
      )

      RentalBooking.create!(
        order_item: order_item,
        product: product,
        start_date: start_date,
        end_date: end_date,
        size: size,
        status: 'active'
      )